import pandas as pd
import numpy as np
import re
import sys
sys.path.append(r'/Users/zhouzhan/Documents/codes/python_code/liver_disease/liver_disease/')
import constants


def combineSHE_TI(df):
    #'舌体'
    df['舌体-胖大'] = df['舌体-胖大'] + df['舌体-胖大齿痕']
    df['舌体-齿痕'] = df['舌体-齿痕'] + df['舌体-胖大齿痕']
    del df['舌体-胖大齿痕']
    return df

# def combineSHE_ZHI(df):
#     # '舌质'

def combineSHE_XIA_MAI_LUO(df):
    # '舌下脉络'
    # {'脉络-正常':'脉络正常|舌下脉络正常', '脉络-迂曲':'脉络迂曲', '脉络-瘀斑':'瘀斑或瘀条|瘀点',
    #                  '脉络-增粗':'脉络增粗', '脉络-瘀点迂曲':'瘀点脉络迂曲'} 
    df['脉络-瘀斑'] = df['脉络-瘀斑'] + df['脉络-瘀点迂曲']
    df['脉络-迂曲'] = df['脉络-迂曲'] + df['脉络-瘀点迂曲']
    del df['脉络-瘀点迂曲']
    return df

def combineSHE_TAI(df):
    # '舌苔'
    # {'舌苔-腻白':'白腻|腻白|白微腻', '舌苔-腻黄':'黄腻|腻黄|腻略黄', '舌苔-黄':'黄', '舌苔-湿润白腻厚':'湿润白厚腻', '舌苔-腻白少':'白腻少', 
    # '舌苔-腻白厚':'白腻厚|白厚腻',
    # '舌苔-黄少':'黄少', '舌苔-黄腻少':'黄腻少', '舌苔-黄厚腻':'腻厚黄|黄腻厚|厚腻黄|黄厚腻.', '舌苔-黄厚':'黄厚', '舌苔-腻少':'少腻',
    #  '舌苔-湿润黄少':'湿润黄少', '舌苔-腻':'腻',
    # '舌苔-白湿润腻':'白湿润腻', '舌苔-白':'白', '舌苔-厚腻湿润':'厚腻湿润', '舌苔-黄干燥少':'黄干燥少', '舌苔-腐黄腻':'腐黄腻', 
    # '舌苔-厚腻腐黄白':'厚腻腐黄白', '舌苔-湿润黄腻':'湿润黄腻',
    # '舌苔-腻湿润':'腻湿润', '舌苔-湿润':'湿润', '舌苔-白黄腻':'白黄腻|白腻黄', '舌苔-薄白':'薄白', 
    # '舌苔-少':'少', '舌苔-白少':'少白',
    # '舌苔-干燥灰黑腻黄':'干燥灰黑腻黄', '舌苔-薄黄腻':'薄黄腻|腻薄黄', '舌苔-白灰黑腻':'白灰黑腻', '舌苔-薄黄厚腻':'薄黄厚腻', 
    # '舌苔-白腻中间有裂痕':'白腻中间有裂痕',
    # '舌苔-白厚':'白厚', '舌苔-少薄黄':'少薄黄', '舌苔-黄干燥':'黄干燥'} 

    df['舌苔-腻黄'] = df['舌苔-薄黄厚腻']
    #1,质（薄，厚，润，燥，腻，腐，剥，偏，全，真，假）;2,色（白，黄，灰黑）少
    df['舌苔-白'] = df['舌苔-腻白'] + df['舌苔-湿润白腻厚'] + df['舌苔-腻白少'] + df['舌苔-腻白厚'] + df['舌苔-白湿润腻']
    + df['舌苔-白'] + df['舌苔-厚腻腐黄白'] + df['舌苔-白黄腻'] + df['舌苔-薄白'] + df['舌苔-白少'] + df['舌苔-白灰黑腻'] + df['舌苔-白腻中间有裂痕']
    + df['舌苔-白厚']

    df['舌苔-黄'] = df['舌苔-腻黄'] + df['舌苔-黄'] + df['舌苔-黄少'] + df['舌苔-黄腻少'] + df['舌苔-黄厚腻'] + df['舌苔-黄厚']
    + df['舌苔-湿润黄少'] + df['舌苔-黄干燥少'] + df['舌苔-腐黄腻'] + df['舌苔-厚腻腐黄白'] + df['舌苔-湿润黄腻']
    + df['舌苔-白黄腻'] + df['舌苔-干燥灰黑腻黄'] + df['舌苔-薄黄腻'] + df['舌苔-少薄黄'] + df['舌苔-黄干燥']

    df['舌苔-灰黑'] = df['舌苔-干燥灰黑腻黄'] + df['舌苔-白灰黑腻']
    df['舌苔-薄'] = df['舌苔-薄白'] + df['舌苔-薄黄腻'] + df['舌苔-少薄黄']
    df['舌苔-厚'] = df['舌苔-湿润白腻厚'] + df['舌苔-腻白厚'] + df['舌苔-黄厚腻'] + df['舌苔-黄厚'] + df['舌苔-厚腻湿润'] + df['舌苔-白厚']
    df['舌苔-润'] = df['舌苔-湿润白腻厚'] + df['舌苔-湿润黄少'] + df['舌苔-白湿润腻'] + df['舌苔-厚腻湿润'] + df['舌苔-湿润黄腻']
    + df['舌苔-腻湿润'] + df['舌苔-湿润']

    df['舌苔-燥'] = df['舌苔-黄干燥少'] + df['舌苔-干燥灰黑腻黄'] + df['舌苔-黄干燥']
    df['舌苔-腻'] = df['舌苔-腻白'] + df['舌苔-腻黄'] + df['舌苔-湿润白腻厚'] + df['舌苔-腻白少'] + df['舌苔-腻白厚'] + df['舌苔-黄腻少']
    + df['舌苔-黄厚腻'] + df['舌苔-腻少'] + df['舌苔-腻'] + df['舌苔-白湿润腻'] + df['舌苔-厚腻湿润'] + df['舌苔-腐黄腻'] + df['舌苔-厚腻腐黄白']
    + df['舌苔-湿润黄腻'] + df['舌苔-腻湿润'] + df['舌苔-白黄腻'] + df['舌苔-干燥灰黑腻黄'] + df['舌苔-薄黄腻'] + df['舌苔-白灰黑腻']
    + df['舌苔-薄黄厚腻'] + df['舌苔-白腻中间有裂痕']

    df['舌苔-腐'] = df['舌苔-厚腻腐黄白'] + df['舌苔-腐黄腻']
    df['舌苔-少'] = df['舌苔-腻白少'] + df['舌苔-黄少'] + df['舌苔-黄腻少'] + df['舌苔-腻少'] + df['舌苔-黄干燥少'] + df['舌苔-少']
    + df['舌苔-白少'] + df['舌苔-少薄黄']

    df['舌苔-裂'] = df['舌苔-白腻中间有裂痕']

    del df['舌苔-腻白']; del df['舌苔-腻黄']; del df['舌苔-湿润白腻厚']; del df['舌苔-腻白少']; del df['舌苔-腻白厚']; del df['舌苔-黄少']
    del df['舌苔-黄腻少']; del df['舌苔-黄厚腻']; del df['舌苔-黄厚']; del df['舌苔-腻少']; del df['舌苔-湿润黄少']; del df['舌苔-白湿润腻']
    del df['舌苔-厚腻湿润']; del df['舌苔-黄干燥少']; del df['舌苔-腐黄腻']; del df['舌苔-厚腻腐黄白']; del df['舌苔-湿润黄腻']; del df['舌苔-腻湿润']
    del df['舌苔-湿润']; del df['舌苔-白黄腻']; del df['舌苔-白灰黑腻']; del df['舌苔-薄黄厚腻']; del df['舌苔-白腻中间有裂痕']; del df['舌苔-白厚']
    del df['舌苔-少薄黄']; del df['舌苔-黄干燥']; del df['舌苔-干燥灰黑腻黄']
    
    return df

def combineSHE_MAI_XIANG(df):
    # '脉象':弦、滑、细、数、弱、沉
    # {'脉象-弦':'弦|弦弦', '脉象-弦滑':'弦滑|滑弦', '脉象-弦数':'弦数', '脉象-弦细':'弦细', '脉象-细弱':'细弱', 
    #                 '脉象-沉细':'沉细', '脉象-实弦':'实弦', '脉象-细数弦':'细数弦', '脉象-实':'实', 
    #                 '脉象-细':'细', '脉象-弦弱':'弦弱', '脉象-细沉数弦':'细沉数弦', '脉象-濡':'濡', '脉象-弦缓':'弦缓', '脉象-滑':'滑'} 

    df['脉象-弦'] = df['脉象-弦'] + df['脉象-弦滑'] + df['脉象-弦数'] + df['脉象-弦细'] + df['脉象-细数弦'] + df['脉象-实弦'] 
    + df['脉象-弦弱'] + df['脉象-细沉数弦'] + df['脉象-弦缓']

    df['脉象-滑'] = df['脉象-弦滑'] + df['脉象-滑']
    df['脉象-细'] = df['脉象-弦细'] + df['脉象-细弱'] + df['脉象-沉细'] + df['脉象-细数弦'] + df['脉象-细'] + df['脉象-细沉数弦']
    df['脉象-数'] = df['脉象-弦数'] + df['脉象-细数弦'] + df['脉象-细沉数弦']
    df['脉象-弱'] = df['脉象-细弱'] + df['脉象-弦弱']
    df['脉象-沉'] = df['脉象-沉细'] + df['脉象-细沉数弦']
    df['脉象-实'] = df['脉象-实'] + df['脉象-实弦']

    del df['脉象-弦滑']
    del df['脉象-弦数']
    del df['脉象-弦细']
    del df['脉象-细弱']
    del df['脉象-沉细']
    del df['脉象-实弦']
    del df['脉象-细数弦']
    del df['脉象-弦弱']
    del df['脉象-细沉数弦']
    del df['脉象-弦缓']

    return df